tests/load_test.yaml
config:
  target: "http://localhost:3000/api/v1"  # Base URL of your Node.js application
  phases:
    - duration: 60  # Duration of the test in seconds
      arrivalRate: 1000  # Number of virtual users to start per second (10,000 users over 60 seconds)

scenarios:
  - flow:
      - post:
          url: "/senders/f47ac10b-58cc-4372-a567-0e02b2c3d479/message/save"  # Dynamic URL with UUID v4 placeholder for sender
          json:
            receiver: "a4cbeb8f-7b84-4aa2-8634-ea93b1bb76e1"  # Dynamic receiver UUID v4
            messageContent: "ABCDE"